In [2]:
import pandas as pd

In [3]:
# função para substituir os caracteres
caracteres = {ord('ä'):'ae', ord('ü'):'ue', ord('ö'):'oe', ord('ß'):'ss'}

In [4]:
# criando dataframe:
data = [['täm', 10], ['nök', 15], ['jüli', 14], ['saß', 22]]
df = pd.DataFrame(data, columns = ['Name', 'Age'])

In [5]:
# reescrevendo a coluna 'Name' com a substituição dos caracteres alemães 
df['Name'] = df['Name'].str.translate(caracteres)

In [6]:
# print dataframe.
df

    Name  Age
0   taem   10
1   noek   15
2  jueli   14
3   sass   22